Model: "Basic_ANN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 7)]               0         
_________________________________________________________________
dense_12 (Dense)             (None, 16)                128       
_________________________________________________________________
batch_normalization_10 (Batc (None, 16)                64        
_________________________________________________________________
dense_13 (Dense)             (None, 32)                544       
_________________________________________________________________
batch_normalization_11 (Batc (None, 32)                128       
_________________________________________________________________
dense_14 (Dense)             (None, 64)                2112      
_________________________________________________________________
batch_normalization_12 (Batc (None, 64)                256       
_________________________________________________________________
dense_15 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_13 (Batc (None, 32)                128       
_________________________________________________________________
dense_16 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_14 (Batc (None, 16)                64        
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 17        
=================================================================
Total params: 6,049
Trainable params: 5,729
Non-trainable params: 320
_________________________________________________________________
